//Задайте прямоугольный двумерный массив. Напишите программу,
//которая будет находить строку с наименьшей суммой элементов.

///////////////////////////////////////////////////////////////
//////////////////////////- Старт -///////////////////////////
/////////////////////////////////////////////////////////////
Console.Clear();

int [,] array = new [,]
{
    {5,3,2,},
    {2,9,6,},
    {8,2,2,}
};

PrintArray(array);

int minSumRowIndex = FindRowWithMinSum(array);

Console.WriteLine("Строка с наименьшей суммой элементов: " + minSumRowIndex);

////////////////////////////////////////////////////////////////////////
////////////////- Метод вывода на печать заданный массив -/////////////
//////////////////////////////////////////////////////////////////////

void PrintArray(int[,] arr)
{
    for (int i = 0; i < arr.GetLength(0); i++)
    {
        Console.Write($"{i}:   ");
        for (int j = 0; j < arr.GetLength(1); j++)
        {
            Console.Write($"{arr[i,j]}\t");
        }
        Console.WriteLine();
    }
}

/////////////////////////////////////////////////////////////////////
/////////////////////////- Решение задачи -/////////////////////////
///////////////////////////////////////////////////////////////////

int FindRowWithMinSum(int[,] array)
{
    int rows = array.GetLength(0);
    int cols = array.GetLength(1);

    int minSum = int.MaxValue;
    int minSumRowIndex = -1;

    for (int i = 0; i < rows; i++)
    {
        int rowSum = 0;

        for (int j = 0; j < cols; j++)
        {
            rowSum += array[i, j];
        }

        if (rowSum < minSum)
        {
            minSum = rowSum;
            minSumRowIndex = i;
        }
    }
    return minSumRowIndex;
}

////////////////////////////////////////////////////////////////////
///////////////////////////////- Конец -///////////////////////////
//////////////////////////////////////////////////////////////////